tap "aoki/redis-cli"
tap "aquaproj/aqua"
tap "aws/tap"
tap "dagger/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "jorgerojas26/lazysql"
tap "localstack/tap"
tap "mas-cli/tap"
tap "michaelroosz/ssh"
tap "microsoft/git"
tap "mike-engel/jwt-cli"
brew "act"
brew "xz"
brew "libtiff"
brew "jpeg-xl"
brew "aom"
brew "asdf"
brew "openssl@3"
brew "cryptography"
brew "awscli"
brew "glib"
brew "ccache"
brew "chrome-cli"
brew "coreutils"
brew "ctags"
brew "curl"
brew "direnv"
brew "dive"
brew "docker-compose"
brew "exiftool"
brew "fzf"
brew "gh"
brew "harfbuzz"
brew "pango"
brew "ghostscript"
brew "git"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "liblqr"
brew "libraw"
brew "imagemagick"
brew "ios-deploy"
brew "jq"
brew "jsonnet"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "mas"
brew "mysql-client"
brew "mysql-client@8.0"
brew "neovim"
brew "oath-toolkit"
brew "openjdk"
brew "openssl@1.1"
brew "perl"
brew "python@3.10"
brew "python@3.11"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "siege"
brew "stylua"
brew "tig"
brew "tmux"
brew "totp-cli"
brew "tree"
brew "vim"
brew "watch"
brew "websocat"
brew "wget"
brew "yq"
brew "aoki/redis-cli/redis-cli"
brew "aquaproj/aqua/aqua"
brew "dagger/tap/dagger"
brew "localstack/tap/localstack-cli"
brew "mike-engel/jwt-cli/jwt-cli"
cask "flipper"
cask "font-hack-nerd-font"
cask "font-monaspace"
cask "font-ricty-diminished"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "ngrok"
cask "visual-studio-code"
cask "zulu@17"
vscode "42crunch.vscode-openapi"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "arcanis.vscode-zipfs"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "folke.vscode-monorepo-workspace"
vscode "gamunu.vscode-yarn"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "grafana.vscode-jsonnet"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.vscode-typescript-next"
vscode "nrwl.angular-console"
vscode "octref.vetur"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "vscodevim.vim"
