tap "aoki/redis-cli"
tap "aquaproj/aqua"
tap "aws/tap"
tap "dagger/tap"
tap "docker/tap", trusted: true
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "jorgerojas26/lazysql"
tap "localstack/tap"
tap "mas-cli/tap"
tap "michaelroosz/ssh"
tap "microsoft/git"
tap "mike-engel/jwt-cli"
tap "oven-sh/bun"
# Run your GitHub Actions locally
brew "act"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Declarative CLI Version manager
brew "aqua"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# General-purpose data compression with high compression ratio
brew "xz"
# Official Amazon AWS command-line interface
brew "awscli"
# Core application library for C
brew "glib"
# Object-file caching compiler wrapper
brew "ccache"
# Create and run Linux containers using lightweight virtual machines
brew "container", link: false
# GNU File, Shell, and Text utilities
brew "coreutils"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Reference implementation for the Development Containers specification
brew "devcontainer"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Isolated development environments using Docker
brew "docker-compose"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Command-line fuzzy finder written in Go
brew "fzf"
# TIFF library and utilities
brew "libtiff"
# New file format for still image compression
brew "jpeg-xl"
# GitHub command-line tool
brew "gh"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Asynchronous event library
brew "libevent"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# C/C++ seam carving library
brew "liblqr"
# Postgres C API library
brew "libpq"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql-client"
# Open source relational database management system
brew "mysql-client@8.0"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Tools for one-time password authentication systems
brew "oath-toolkit"
# Development kit for the Java programming language
brew "openjdk"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Highly capable, feature-rich programming language
brew "perl"
# Paste PNG into files
brew "pngpaste"
# Object-relational database system
brew "postgresql@17"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Autoformat shell script source code
brew "shfmt"
# HTTP regression testing and benchmarking utility
brew "siege"
# SOund eXchange: universal sound sample translator
brew "sox"
# Opinionated Lua code formatter
brew "stylua"
# System performance benchmark tool
brew "sysbench"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Suite of barcodes-reading tools
brew "zbar"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
cask "container"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Desktop debugging platform for mobile developers
cask "flipper"
cask "font-hack-nerd-font"
cask "font-monaspace"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Tools to protect your emails and files
cask "gpg-suite"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Build, run, and govern agents across the software development lifecycle
cask "docker/tap/sbx", trusted: true
# Open-source code editor
cask "visual-studio-code"
# OpenJDK distribution from Azul
cask "zulu@17"
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Sequel Ace", id: 1518036000
mas "Xcode", id: 497799835
vscode "42crunch.vscode-openapi"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "arcanis.vscode-zipfs"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "folke.vscode-monorepo-workspace"
vscode "gamunu.vscode-yarn"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "grafana.vscode-jsonnet"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.vscode-typescript-next"
vscode "nrwl.angular-console"
vscode "octref.vetur"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "vscodevim.vim"
