tap "aws/tap"
tap "bastionzero/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "kayac/tap"
tap "mas-cli/tap"
tap "microsoft/git"
tap "mike-engel/jwt-cli"
brew "aom"
brew "coreutils"
brew "openssl@3"
brew "asdf"
brew "aws-sam-cli"
brew "python@3.11"
brew "awscli"
brew "berkeley-db"
brew "ctags"
brew "curl"
brew "direnv"
brew "dive"
brew "docker-compose"
brew "libevent"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "harfbuzz"
brew "graphviz"
brew "jq"
brew "kubernetes-cli"
brew "localstack"
brew "mas"
brew "neovim"
brew "node-build"
brew "openssl@1.1"
brew "python@3.10"
brew "openjdk"
brew "perl"
brew "rename"
brew "ruby"
brew "siege"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "watchman"
brew "websocat"
brew "yq"
brew "yt-dlp"
brew "zeromq"
brew "bastionzero/tap/zli"
brew "mike-engel/jwt-cli/jwt-cli"
cask "font-monaspace"
cask "font-ricty-diminished"
cask "gpg-suite"
cask "ngrok"
cask "visual-studio-code"
cask "zulu17"
mas "Sequel Ace", id: 1518036000
mas "Xcode", id: 497799835
vscode "42crunch.vscode-openapi"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "arcanis.vscode-zipfs"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "folke.vscode-monorepo-workspace"
vscode "gamunu.vscode-yarn"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.vscode-typescript-next"
vscode "nrwl.angular-console"
vscode "octref.vetur"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "vscodevim.vim"
